#!/usr/bin/env python
{
# "singular form (0)": ["first plural form (1)", "second plural form (2)", ...],
'байт': ['байти','байтів'],
'годину': ['години','годин'],
'день': ['дні','днів'],
'елемент': ['елементи','елементів'],
'запис': ['записи','записів'],
'місяць': ['місяці','місяців'],
'поцілювання': ['поцілювання','поцілювань'],
'рядок': ['рядки','рядків'],
'рік': ['роки','років'],
'секунду': ['секунди','секунд'],
'схибнення': ['схибнення','схибнень'],
'тиждень': ['тижні','тижнів'],
'хвилину': ['хвилини','хвилин'],
}
